---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarConstraintsManager
source: html/a3fe6196-6881-f395-e112-4ea1876caef2.htm
---
# RebarConstraintsManager Properties

A static property defining if the 'Rebar Constrained Placement' setting is on or off in current Revit Application Session.